import React from 'react';
import { MainLayout } from '../../Components';

export const AboutMePage = () => (
  <MainLayout>
    <div className="container">
      <p>
        Всем привет. Меня зовут Сергей, мне 30 лет, проживаю в городе Киев, Украина. В целом я был довольно обычным ребенком, садик, школа до 8го класса, а после
        8-го класса дедушка отдал меня в военный лицей, так как сам он был летчиком и все родственники (дед один, второй, дядька, отец) были военными и
        дед решил что и я должен буду быть военным. Наверняка у многих похожая история, когда родители хотят что б сын или дочь шли по их стопам.
        На протяжении всей жизни я помню себя толстеньким, не то что б сильно, ну пузо всегда присутствовало, не могу сказать что еды у меня было мало - ел все что попадалось под руку,
        с детсва у меня было много жаренного - картошка, курицы, яйцо, сосиски, сордельки, кока-кола и т.д.  В среднем возрасте детсва, наверное лет с 8 - 10 появлялось много сладкого, пусть и дешевого - конфеты, шоколадки, печенье и т.д.
        Самые дешевые кетчупы, майонезы, соусы и все что можно сюда отнести так же присутствовали. Лет с 12 - 14 добавились сухарики, чипсы и прочие такие штуки, пусть и не в очень больших количествах, по началу.
      </p>
      <p>
        В школе, где-то до 8 класса жил еще детской жизнью, увлекался разными спортивными секциями, в первом классе было карате, футбол (пока мяч в нос не попал и я больше не любил футбол &#x1f601;) потом дзюдо, параллельно
        ходил в секцию по шахматам (так же решение того же деда &#x1f601;), любил плавать, заниматься акробатикой, потом пришел брейк-данс. То есть первая моя детская жизнь была
        довольно таки не плохой, как мне сейчас кажется, пусть наполовину я жил отчасти не своей жизнью.
        С приходом 8го класса, это было в районе 12 лет, связался уже с "крутыми" ребятами, которые помогли научиться курить и бухать. На всех переменнах мы выбигали курить, после чего заедали всякими мятными конфетами, что конечно же не снимала запах курения.
        Курением в целом это было тогда трудно назвать, мы курили одну сигарету на троих или четверых, а пробовать бухать мы только только начинали, но по сути начало этого пути было заложенно именно здесь.
      </p>
      <p>
        С 9го класса как я писал выше меня отправили в военный лицей, а что это значило - это значит жизнь в казарме с еще другими же парнями и таких нас было около 150 человек.
        Все будни мы жили в казармах, а только в субботу после обеда и до понельника нас отпускали домой при условии хорошей дисциплины и хороших оценок. В целом я не вижу смысла описывать 
        все плюса и минуса, которые я получил в этом лицее, но акцент я б хотел сделать на то, что я все так же продолжал курить в тихаря там, пусть намного и реже чем тогда, когда меня отпускали на выходные. Очень часто вместо 
        утренних зарядок я просился на уборку территории что б покурить, а выходные почти всегда я проводил в компании "крутых" ребят распивая спирт.
      </p>
      <p>
        После военного лицея, я попал в почти такой же военный университет, правда в нем уже было чем-то проще, было больше свободы, особенно чем старше курс.
        Там же я продолжал бухать, курить, хотя где-то на 3м курсе у меня уже были мысли и попытки "бросить" курить, но эти попытки не заканчивались успехом. Все это время находясь в универе я не думал в целом ни о чем, я тупо просирал 4 года, так же
        как и просрал годы в лицее. Только спустя какое-то время, когда я изменился, я осознаю чего б мог достичь, кем бы я мог бы быть, если б тогда я владел информацией, осознастью, которая есть сейчас во мне, хотя признаюсь что сейчас ох сколько всего, над чем
        мне нужно работать.
      </p>
      <p>
        После универа мне нужно было отработать 3 года по контракту в бюджетной организации. Не буду так же особо расписывать чем я занимался, но это была по сути трата жизни в пустую, при чем за очень
        маленькие гроши. И первые два года такой работы, я все так же закрывал глаза на жизнь, обманывал самого себя мол все ок и так длилось изо дня в день. Зато у меня в жизни были особые, любимы дни - выходные. Я с радостью их ждал, а потом так напивался тем же пивом, заедая чипсами, орешками и т.д.
        И уже после 2х лет такой жизни, мне вселенная начала подкидывать скажем так знаки (люди, посты, блоги), которые заставляли меня начинать задумываться что что-то нужно менять в своей жизни. Я начал понимать что сейчас, живя такой жизнью
        я не могу позволить себе по большому счету ничего.
      </p>
      <p>
        И вот уже с этого времени я начал меняться, я начал делать что-то, что должно было изменить мою жизнь. Мне тогда было 25-26 лет. 30 июня 2013 года я бросил курить.
        Я начал изучать IT технологии, посвещать все свободное время им, на что у меня ушел где-то один год, после чего я смог отказаться от прошлой жизни (работы) и устроиться на свою первую работу, куда мне реально хотелось, куда меня тянуло и я с радостью ходил на нее и получал удовольствие.
        В целом этот момент, смена работы это была та координальная точка перелома, которая меня очень сильно поменяла в лучшую сторону. Но выпивка на выходных у меня еще была и на то время я еще не думал ни о здоровье, ни о питании.
        Ко мне пришли деньги. По сути, это не большие деньги, что-то около 400$, но уже эта сумма меня заставляла кайфовать, я уже мог позволить многие вещи, которые мне были недоступны в прошлой жизни.
      </p>
      <p>
        С того времени прошло еще где-то года 2 и снова мне вселенная подкинула знак,  в один день я увидел себя в зеркальне очень жирным и ужаснулся. Большое пузо, 94 кг веса и осознание, осознание того что 
        я реально жирный урод. Да, конечно я видел себя таким же и раньше, но вот именно в этот миг что-то счелкнуло в моей голове, нужно меняться. И тут же вселенная мне начала подкидывать информацию по питанию, про похудение, про здоровье, про различные диеты.
        Я начала активно изучать все эти вещи, в мою жизнь начал входить уже и спорт (бег, упражнения со своим весом) и под новый год, это было где-то 20 декабря 2017 года я решил окончательно что 
        2018 год будет год здоровья, правильного питания, работы над собой. С этого дня я перестал пить любой алкоголь вообще, а уже с через неделю я изменил все свои привычки питания, особенно вредные - отказ от сладкого, жаренного, чипсов, колы и т.д.
        В первые 4 месяца я похудел где-то на 25 кг, моя форма стала координально другой и все люди которые меня знали по сути вообще не узнавали меня.
        Если взять фотку тогда и сейчас то можно сказать что от того меня взяли и отрезали половину &#x1f601;.
      </p>
      <p>
        Спустя пол года я уже начал себе позволять какие-то старые вкусовые привычки, по-тихоньку возвращались сладости, какие-то вредоности. Но я стараюсь максимально отслеживать свои скачки в весе и как только вес выходит за рамки приемлевого, сразу же 
        активно работаю над похудением. На сегодняшний день я все так же продолжаю активно работать над собой, 
      </p>
    </div>
  </MainLayout>
)